developpement/src/app/Controllers/Abonne.php

SELECT *
FROM `visiteur`
---
    public function index($col='id_visiteur',$typeTri='desc')
    {
        $mAbonne =new abonneModel();
        $modelVisiteur = new visiteurModel();
        $ids = $mAbonne->findColumn('id_visiteur');
        $visiteurs = $modelVisiteur->findAll();
        // on ajooute la colonne "id_visiteur" pour le visite.js puisse prendre en compte ces elements
        foreach($visiteurs as $key=>$vst)
        {
            $visiteurs[$key]['id_visiteur']=$vst['id'];
        }
        $abonnes= $mAbonne->findAll();