developpement/src/app/Controllers/Apprenant.php

SELECT *
FROM `visiteur`
---
    public function index($col='id',$typeTri='desc')
    {
        $modelApprenant = new apprenantModel();
        $modelVisiteur = new visiteurModel();
        $result=$modelApprenant->get_apprenants();
        //tri
        if($typeTri=="desc"){
            array_sort_by_multiple_keys($result,[
                $col=>SORT_DESC
            ]);
        }
        else
        {
            array_sort_by_multiple_keys($result,[
                $col=>SORT_ASC
            ]);
        }
        return view('liste_apprenant', ['tab_visiteurs' => $modelVisiteur->findAll(),'tab_appr'=>$result]);