developpement/src/app/Controllers/Emprunt.php

    public function index($col='id',$typeTri='desc')
    {
        $mEmprunt=new empruntModel();
        $mLivre=new ouvrageModel();
        $mAbn=new abonneModel();


        $tab_emprunt=$mEmprunt->findAll();
        foreach($tab_emprunt as $key=>$elt)
        {
            $tab_emprunt[$key]['emprunteur']=$mAbn->get_attr_of($elt['id_abonne'],'prenom')." ".$mAbn->get_attr_of($elt['id_abonne'],'nom');
            $tab_emprunt[$key]['livre']="<strong>".$mLivre->get_attr_of($elt['id_ouvrage'],'titre')."</strong> de ".$mLivre->get_attr_of($elt['id_ouvrage'],'nom_auteur');
        }
        $tab_abn=$mAbn->get_abn_eligible();


        foreach($tab_abn as $key=>$value)
        {
            $tab_abn[$key]['nom']=$mAbn->get_attr_of($value['id_visiteur'],'nom');
            $tab_abn[$key]['prenom']=$mAbn->get_attr_of($value['id_visiteur'],'prenom');
        }
        $tab_livre=$mLivre->findAll();
---
SELECT *
FROM `ouvrage`