developpement/src/app/Controllers/Visite.php

SELECT *
FROM `visiteur`
SELECT *
FROM `visite`
---
    public function index()
    {
        $visiteModel = new visiteModel();
        $empModel = new employerModel();
        $visiteurModel = new visiteurModel();
        $visiteurs=$visiteurModel->findAll();
        foreach($visiteurs as $key=>$vst)
        {
            $visiteurs[$key]['id_visiteur']=$vst['id'];
        }
        $tab = array();
        $toShow = array();
        $visites = $visiteModel->findAll();