developpement/src/app/Models/abonneModel.php

SELECT *
FROM `visiteur`
WHERE `visiteur`.`id` = '1'
---
    public function get_infos_abn(){
        $mVisiteur=new visiteurModel();
        $colunm=$this->findColumn('id_visiteur');
        return $mVisiteur->find($colunm);