developpement/src/app/Models/apprenantModel.php

SELECT *
FROM `apprenant`
WHERE `apprenant`.`id_visiteur` = '1'
SELECT *
FROM `visiteur`
WHERE `visiteur`.`id` IN ('1','45','46')
---
    public function get_infos_apprs(){
        $mVisiteur=new visiteurModel();
        $colunm=$this->findColumn('id_visiteur');
        return $mVisiteur->find($colunm);