developpement/src/app/Models/employerModel.php

SELECT *
FROM `employer`
WHERE `employer`.`id` = 1
---
    public function get_attr_of($id,$attr)
    {
        $elt=$this->find($id);