developpement/src/app/Models/formationModel.php

    public function get_attr_of($id,$attr)
    {
        $elt=$this->find($id);
---
SELECT *
FROM `formation`
WHERE `formation`.`id` = '0'