developpement/src/app/Models/ouvrageModel.php

    public function get_attr_of($id,$attr)
    {
        $elt=$this->find($id);
---
SELECT *
FROM `ouvrage`
WHERE `ouvrage`.`id` = '1'