developpement/src/app/Models/visiteurModel.php

    public function get_attr_of($id,$attr)
    {
        $elt=$this->find($id);
---
SELECT *
FROM `visiteur`
WHERE `visiteur`.`id` = '1'